wfs2/src/wfs.createStoredQuery.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xlink="http://www.w3.org/1999/xlink"
    xmlns:idls="http://inspire.ec.europa.eu/schemas/inspire_dls/1.0"
    xmlns:fes="http://www.opengis.net/fes/2.0"
    xmlns:icommon="http://inspire.ec.europa.eu/schemas/common/1.0"
    xmlns:util="http://www.opengis.net/wfs-util/2.0"
    xmlns:ows="http://www.opengis.net/ows/1.1"
    xmlns:f2i-plu="http://plu.fit2inspire.eu/plu3"
    xmlns:wfs="http://www.opengis.net/wfs/2.0">
 <SOAP-ENV:Body>
   <wfs:CreateStoredQuery service="WFS" version="" handle="">
    <!-- extensibility element(s) -->
    <wfs:StoredQueryDefinition id="_1">
     <!-- extensibility element(s) -->
     <wfs:Title xml:lang="en"></wfs:Title>
     <wfs:Abstract xml:lang="en"></wfs:Abstract>
     <ows:Metadata about="http://www.example.com/schema/anyURI" xlink:type="simple" xlink:href="http://www.example.com/schema/anyURI" xlink:role="http://www.example.com/schema/anyURI" xlink:arcrole="http://www.example.com/schema/anyURI" xlink:title="" xlink:show="new" xlink:actuate="onLoad">
      <!-- extensibility element(s) -->
     </ows:Metadata>
     <wfs:Parameter name="" type="xsd:string">
      <!-- extensibility element(s) -->
      <wfs:Title xml:lang="en"></wfs:Title>
      <wfs:Abstract xml:lang="en"></wfs:Abstract>
      <ows:Metadata about="http://www.example.com/schema/anyURI" xlink:type="simple" xlink:href="http://www.example.com/schema/anyURI" xlink:role="http://www.example.com/schema/anyURI" xlink:arcrole="http://www.example.com/schema/anyURI" xlink:title="" xlink:show="new" xlink:actuate="onLoad">
       <!-- extensibility element(s) -->
      </ows:Metadata>
     </wfs:Parameter>
     <wfs:QueryExpressionText returnFeatureTypes="xsd:string" language="http://www.example.com/schema/anyURI" isPrivate="false">
      <!-- extensibility element(s) -->

      <!-- extensibility element(s) -->
     </wfs:QueryExpressionText>
    </wfs:StoredQueryDefinition>
   </wfs:CreateStoredQuery>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
