52n-ses/52n-ses-utils/src/test/resources/org/n52/ses/util/test/WFSGetFeature.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:wsa="http://www.w3.org/2005/08/addressing">
	<soap:Header>
		<wsa:From>
			<wsa:Address>http://www.w3.org/2005/08/addressing/role/anonymous</wsa:Address>
		</wsa:From>
	</soap:Header>
	<soap:Body>
		<wfs:GetFeature xmlns:fes="http://www.opengis.net/fes/2.0"
			xmlns:wfs="http://www.opengis.net/wfs/2.0" xmlns:gml="http://www.opengis.net/gml/3.2"
			xmlns:aixm="http://www.aixm.aero/schema/5.1" service="WFS" version="2.0.0"
			count="10">
			<wfs:Query typeNames="aixm:AirportHeliport">
				<fes:Filter xmlns:fes="http://www.opengis.net/fes/2.0">
					<fes:And>
						<fes:PropertyIsEqualTo>
							<fes:ValueReference>gml:identifier</fes:ValueReference>
							<fes:Literal>00702AD9-B763-4392-BAAA-D6A95A2BF0D9</fes:Literal>
						</fes:PropertyIsEqualTo>
						<fes:AnyInteracts>
							<fes:ValueReference>aixm:timeSlice//gml:validTime</fes:ValueReference>
							<gml:TimePeriod gml:id="validTimeStart">
								<gml:beginPosition>2009-01-01T12:00:00.000+01:00</gml:beginPosition>
								<gml:endPosition>2020-01-01T12:00:00.000+01:00</gml:endPosition>
							</gml:TimePeriod>
						</fes:AnyInteracts>
					</fes:And>
				</fes:Filter>
			</wfs:Query>
		</wfs:GetFeature>
	</soap:Body>
</soap:Envelope>