src_wfs_src_test_java_org_geoserver_wfs_v2__0_DescribeFeatureTypeTest.java/[CN]/DescribeFeatureTypeTest/[MT]/testSOAP()/body

{
  String xml="<soap:Envelope xmlns:soap='http://www.w3.org/2003/05/soap-envelope'> " + " <soap:Header/> " + " <soap:Body>"+ "<wfs:DescribeFeatureType service='WFS' version='2.0.0' "+ "xmlns:wfs='http://www.opengis.net/wfs/2.0' "+ "xmlns:sf='" + MockData.PRIMITIVEGEOFEATURE.getNamespaceURI() + "'>"+ " <wfs:TypeName>"+ getLayerId(MockData.PRIMITIVEGEOFEATURE)+ "</wfs:TypeName>"+ "</wfs:DescribeFeatureType>"+ " </soap:Body> "+ "</soap:Envelope> ";
  MockHttpServletResponse resp=postAsServletResponse("wfs",xml,"application/soap+xml");
  assertEquals("application/soap+xml",resp.getContentType());
  Document dom=dom(new ByteArrayInputStream(resp.getOutputStreamContent().getBytes()));
  assertEquals("soap:Envelope",dom.getDocumentElement().getNodeName());
  XMLAssert.assertXpathEvaluatesTo("xsd:base64","//soap:Body/@type",dom);
  assertEquals(1,dom.getElementsByTagName("wfs:DescribeFeatureTypeResponse").getLength());
  String base64=dom.getElementsByTagName("wfs:DescribeFeatureTypeResponse").item(0).getFirstChild().getNodeValue();
  byte[] decoded=Base64.decodeBase64(base64.getBytes());
  dom=dom(new ByteArrayInputStream(decoded));
  assertEquals("xsd:schema",dom.getDocumentElement().getNodeName());
}
