src_wfs_src_test_java_org_geoserver_wfs_v2__0_GetCapabilitiesTest.java/[CN]/GetCapabilitiesTest/[MT]/testSOAP()/body

{
  String xml="<soap:Envelope xmlns:soap='http://www.w3.org/2003/05/soap-envelope'> " + " <soap:Header/> " + " <soap:Body>"+ "<GetCapabilities service=\"WFS\" "+ " xmlns=\"http://www.opengis.net/wfs/2.0\" "+ " xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" "+ " xsi:schemaLocation=\"http://www.opengis.net/wfs/2.0 "+ " http://schemas.opengis.net/wfs/2.0/wfs.xsd\"/>"+ " </soap:Body> "+ "</soap:Envelope> ";
  MockHttpServletResponse resp=postAsServletResponse("wfs",xml,"application/soap+xml");
  assertEquals("application/soap+xml",resp.getContentType());
  Document dom=dom(new ByteArrayInputStream(resp.getOutputStreamContent().getBytes()));
  assertEquals("soap:Envelope",dom.getDocumentElement().getNodeName());
  assertEquals(1,dom.getElementsByTagName("wfs:WFS_Capabilities").getLength());
}
