src_wfs_src_test_java_org_geoserver_wfs_v2__0_GetFeatureTest.java/[CN]/GetFeatureTest/[MT]/testSOAP()/body

{
  String xml="<soap:Envelope xmlns:soap='http://www.w3.org/2003/05/soap-envelope'> " + " <soap:Header/> " + " <soap:Body>"+ "<wfs:GetFeature "+ "service='WFS' "+ "version='2.0.0' "+ "xmlns:cdf='http://www.opengis.net/cite/data' "+ "xmlns:wfs='http://www.opengis.net/wfs/2.0' "+ "> "+ "<wfs:Query typeNames='cdf:Other'> "+ "<wfs:PropertyName>cdf:string2</wfs:PropertyName> "+ "</wfs:Query> "+ "</wfs:GetFeature>"+ " </soap:Body> "+ "</soap:Envelope> ";
  MockHttpServletResponse resp=postAsServletResponse("wfs",xml,"application/soap+xml");
  assertEquals("application/soap+xml",resp.getContentType());
}
